DataProcessors/umk_СоздатьКомпелекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_СоздатьКомпелекты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПорция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПорциями</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопытками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/umk_НормыРасходаУпаковки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_НормыРасходаУпаковки</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументУстановкаНорм</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаНормРасходаУпаковки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ГруппыХарактеристик</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыСписанияОстаткаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СпособыСписанияОстаткаТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРезерва</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаНормРасходаУпаковки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УстановкаНормРасходаУпаковки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.umk_НормыРасходаУпаковки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ГруппыХарактеристик</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/umk_СоздатьКомпелекты/Ext/ObjectModule.bsl
Перем МассивДокументов;

Процедура СформироватьКомплекты()Экспорт
	
	МассивДокументов = Новый Массив;
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	СтруктураУпаковки = Неопределено;
	
	Форма = ПолучитьФорму("Форма");
	
	Если Форма.Открыта() Тогда
		Прогресс = Форма.ЭлементыФормы.Индикатор;
		Прогресс.Значение = 0;
		Прогресс.МаксимальноеЗначение =  (ДатаОкончания - ДатаНачала) / 86400;
	КонецЕсли;
		
	 n = 0;
	 	 
	Дата = ДатаНачала;
	 
	Пока (ДатаНачала + n*86400) <= ДатаОкончания Цикл
		
		Дата = ДатаНачала + n*86400;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	РеализацияТоваровУслугТовары.Ссылка.Склад,
		|	РеализацияТоваровУслугТовары.Коэффициент,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
		|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
		|	РеализацияТоваровУслугТовары.НалоговоеНазначение
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|	И НЕ РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
		|	И РеализацияТоваровУслугТовары.Ссылка.Склад = &Склад
		|	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
		|	РеализацияТоваровУслугТовары.Ссылка.Склад,
		|	РеализацияТоваровУслугТовары.Коэффициент,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.СчетУчетаБУ,
		|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
		|	РеализацияТоваровУслугТовары.НалоговоеНазначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.КоличествоОстаток,
		|	ВремТаб.Номенклатура,
		|	ВремТаб.ХарактеристикаНоменклатуры,
		|	ХозрасчетныйОстатки.КоличествоОстаток * -1 / ВремТаб.Коэффициент КАК Количество,
		|	ВремТаб.Коэффициент,
		|	ВремТаб.ЕдиницаИзмерения,
		|	ВремТаб.СчетУчетаБУ,
		|	ВремТаб.СерияНоменклатуры,
		|	ВремТаб.НалоговоеНазначение
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				&Период,
		|				Счет = &Счет_26,
		|				,
		|				Субконто2 = &Склад
		|					И Организация = &Организация) КАК ХозрасчетныйОстатки
		|		ПО ВремТаб.Номенклатура = ХозрасчетныйОстатки.Субконто1
		|			И ВремТаб.Склад = ХозрасчетныйОстатки.Субконто2
		|			И ВремТаб.ХарактеристикаНоменклатуры = ХозрасчетныйОстатки.Субконто3.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("ДатаН", НачалоДня(Дата));
		Запрос.УстановитьПараметр("ДатаК", КонецДня(Дата));
		Запрос.УстановитьПараметр("Период",Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Склад", СкладПродукции);
		Запрос.УстановитьПараметр("Счет_26", ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		Запрос.УстановитьПараметр("ПустаяХарактеристика", ПустаяХарактеристика);
		Запрос.УстановитьПараметр("Организация",Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаПродукции = РезультатЗапроса.Выгрузить();
		
		 n = n + 1;
		 
		// Создаем документ комплект
		
		НомерДокументаВПорции = 0;
		
		Для Каждого СтрокаПродукции Из ТаблицаПродукции Цикл
			
			ОбработкаПрерыванияПользователя();
			
			
			Если НомерДокументаВПорции >= ДокументПорция
				Тогда
				umk_Доработки.Пауза(ПаузаМеждуПорциями);
				НомерДокументаВПорции = 0
			КонецЕсли;
			
			
		   ТаблицаКомплектующих = ПолучитьКомплектующие(СтрокаПродукции.ХарактеристикаНоменклатуры, НачалоМесяца(Дата));
		   
		   Если Не ТаблицаКомплектующих = Неопределено  Тогда
			   
			   ДокументСоздан = СоздатьДокументКомплектации(СтрокаПродукции, ТаблицаКомплектующих, Дата + 1);
			   
			   Если Не ДокументСоздан  Тогда
				   Сообщить(Строка(ТекущаяДата()) + ". Операция прервана в периоде: " + Строка(Дата), СтатусСообщения.ОченьВажное);
				   Возврат
			   КонецЕсли;
		   КонецЕсли;
		   
		НомерДокументаВПорции = НомерДокументаВПорции +1;
		
		КонецЦикла; // По документам комплектация за день
		
		
		Если Форма.Открыта() тогда
			
			Прогресс.Значение = Прогресс.Значение + 1;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	#Если Клиент Тогда
		
	#КонецЕсли

	
Конецпроцедуры

Функция СоздатьДокументКомплектации(СтрокаПродукции, ТаблицаКомплектующих, Дата)
	 
	
	Документ = Документы.КомплектацияНоменклатуры.СоздатьДокумент();
	Документ.Дата = Дата;
	Документ.Комментарий = "##Создан обработкой";
	
	// Заполнить реквизиты значениями по умолчанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Документ, глЗначениеПеременной("глТекущийПользователь"));
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Документ, глЗначениеПеременной("глТекущийПользователь"));
	Документ.Склад = СкладПродукции;
	Документ.СкладМатериалов = СкладМатериалов;
	Документ.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
	
	ЗаполнитьЗначенияСвойств(Документ, СтрокаПродукции);
	Документ.Склад = СкладПродукции;
	Документ.Организация = Организация;
		
	// 1.Номенклатура 
	НоваяСтрока = Документ.Комплектующие.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПродукции,,"ХарактеристикаНоменклатуры");
	
	Для Каждого СтрокаКомпл Из ТаблицаКомплектующих Цикл 
		
		// 2.Упаковка
		НоваяСтрока = Документ.Комплектующие.Добавить();
		
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКомпл);
		КоличествоНеобходимо = СтрокаКомпл.Количество * СтрокаПродукции.Количество * СтрокаПродукции.Коэффициент;
		НоваяСтрока.Количество = ?(КоличествоНеобходимо < 0.001, 0.001, КоличествоНеобходимо);

		
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, Документ);
		
		ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаКомплектующихТабЧасти(НоваяСтрока, Документ);
		Документ.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Комплектующие", 
		Документ.ОтражатьВБухгалтерскомУчете, Документ.ОтражатьВБухгалтерскомУчете);
		
	КонецЦикла;
	
	
	//ДокументЗаписан = ЗаписатьДокумент(Документ, 0);
	
	ДокументЗаписан = Ложь;
	
	ЗаписатьДокумент(Документ, 0, ДокументЗаписан);
	
	Возврат ДокументЗаписан
	
КонецФункции

Процедура ЗаписатьДокумент(ДокументОбъект, НомерПопытки, ДокументЗаписан, ПерваяПопытка = Истина)
	
	ОбработкаПрерыванияПользователя();
	
	Если Не  ПерваяПопытка Тогда
		
		umk_Доработки.Пауза(ПаузаМеждуПопытками);
		
	КонецЕсли;
	
	Если НомерПопытки >= КоличествоПопыток И Не ПерваяПопытка
		
		Тогда
		
		ДокументЗаписан = Ложь;
		
		Возврат
		
	КонецЕсли;
	
	
	Попытка						
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументЗаписан = Истина;
		
		Возврат 
		
	Исключение
		
		НомерПопытки = НомерПопытки + 1;
		ПерваяПопытка = Ложь;
		
		ЗаписатьДокумент(ДокументОбъект, НомерПопытки, ДокументЗаписан, Ложь);
		
	КонецПопытки;

	
КонецПроцедуры

Функция ПолучитьКомплектующие(Характеристика, Период)
		
	// По ссылке;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	УстановкаНормРасходаУпаковкиМатериалы.Номенклатура,
	|	УстановкаНормРасходаУпаковкиМатериалы.Количество,
	|	УстановкаНормРасходаУпаковкиМатериалы.ЕдиницаИзмерения,
	|	УстановкаНормРасходаУпаковкиМатериалы.Коэффициент,
	|	УстановкаНормРасходаУпаковкиМатериалы.ХарактеристикаНоменклатуры,
	|	УстановкаНормРасходаУпаковкиМатериалы.СерияНоменклатуры
	|ИЗ
	|	РегистрСведений.umk_НормыРасходаУпаковки КАК НормыРасходаУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаНормРасходаУпаковки.Материалы КАК УстановкаНормРасходаУпаковкиМатериалы
	|		ПО НормыРасходаУпаковки.ДокументУстановкаНорм = УстановкаНормРасходаУпаковкиМатериалы.Ссылка
	|ГДЕ
	|	НормыРасходаУпаковки.Упаковка.Наименование = &НаименованиеХарактеристики
	|	И НормыРасходаУпаковки.Период = &Период";
	
	Запрос.УстановитьПараметр("НаименованиеХарактеристики", Характеристика.Наименование);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаКомплектующих =  Запрос.Выполнить().Выгрузить();
	
	Если Не ТаблицаКомплектующих.Количество() = 0
		Тогда  Возврат ТаблицаКомплектующих
	КонецЕсли;
	
	// По наименование;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.Номенклатура,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.Количество,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.ЕдиницаИзмерения,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.Коэффициент,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.ХарактеристикаНоменклатуры,
	|	umk_УстановкаНормРасходаУпаковкиМатериалы.СерияНоменклатуры
	|ИЗ
	|	РегистрСведений.umk_НормыРасходаУпаковки КАК umk_НормыРасходаУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаНормРасходаУпаковки.Материалы КАК umk_УстановкаНормРасходаУпаковкиМатериалы
	|		ПО umk_НормыРасходаУпаковки.ДокументУстановкаНорм = umk_УстановкаНормРасходаУпаковкиМатериалы.Ссылка
	|ГДЕ
	|	umk_НормыРасходаУпаковки.Упаковка = &НаименованиеХарактеристики
	|	И umk_НормыРасходаУпаковки.Период = &Период";
	
	Запрос.УстановитьПараметр("НаименованиеХарактеристики", Характеристика.Наименование);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаКомплектующих =  Запрос.Выполнить().Выгрузить();
	
	Если Не ТаблицаКомплектующих.Количество() = 0
		Тогда  Возврат ТаблицаКомплектующих
	КонецЕсли;
	

	
	
	// Иначе По группе упаковки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаНормРасходаУпаковкиМатериалы.Номенклатура,
		|	УстановкаНормРасходаУпаковкиМатериалы.Количество,
		|	УстановкаНормРасходаУпаковкиМатериалы.ЕдиницаИзмерения,
		|	УстановкаНормРасходаУпаковкиМатериалы.Коэффициент,
		|	УстановкаНормРасходаУпаковкиМатериалы.ХарактеристикаНоменклатуры,
		|	УстановкаНормРасходаУпаковкиМатериалы.СерияНоменклатуры
		|ИЗ
		|	РегистрСведений.umk_НормыРасходаУпаковки КАК НормыРасходаУпаковки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаНормРасходаУпаковки.Материалы КАК УстановкаНормРасходаУпаковкиМатериалы
		|		ПО НормыРасходаУпаковки.ДокументУстановкаНорм = УстановкаНормРасходаУпаковкиМатериалы.Ссылка
		|ГДЕ
		|	НормыРасходаУпаковки.Упаковка.Ссылка = &ГруппаХарактеристики
		|	И НормыРасходаУпаковки.Период = &Период";
	
		
	Запрос.УстановитьПараметр("ГруппаХарактеристики", Характеристика.umk_ГруппаХарактеристики);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();
	
	Если Не ТаблицаКомплектующих.Количество() = 0
		Тогда  Возврат ТаблицаКомплектующих
	КонецЕсли;

	// Нет ничего
	
	Сообщить("Не установлена норма расхода комплектующих для номенклатуры: " + Строка(Характеристика.Владелец) + ", хар-ка: " + Строка(Характеристика));
	
	Возврат Неопределено

		
КонецФункции
